# Inception-YOLOv8 — novel thermal animal detection architecture
# InceptionModule at backbone stages 2, 4, 6
# Parallel multi-scale feature extraction for thermal animal detection

nc: 1

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0 - stem 320x320x64
  - [-1, 1, Conv, [128, 3, 2]]          # 1 - 160x160x128
  - [-1, 1, InceptionModule, [128]]     # 2 - INCEPTION multi-scale
  - [-1, 1, Conv, [256, 3, 2]]          # 3 - 80x80x256
  - [-1, 1, InceptionModule, [256]]     # 4 - INCEPTION multi-scale P3
  - [-1, 1, Conv, [512, 3, 2]]          # 5 - 40x40x512
  - [-1, 1, InceptionModule, [512]]     # 6 - INCEPTION multi-scale P4
  - [-1, 1, Conv, [1024, 3, 2]]         # 7 - 20x20x1024
  - [-1, 1, C2f, [1024, True]]          # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9 - P5

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10
  - [[-1, 6], 1, Concat, [1]]                     # 11 - cat P4
  - [-1, 3, C2f, [512]]                           # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13
  - [[-1, 4], 1, Concat, [1]]                     # 14 - cat P3
  - [-1, 3, C2f, [256]]                           # 15 - P3 out

  - [-1, 1, Conv, [256, 3, 2]]                    # 16
  - [[-1, 12], 1, Concat, [1]]                    # 17
  - [-1, 3, C2f, [512]]                           # 18 - P4 out

  - [-1, 1, Conv, [512, 3, 2]]                    # 19
  - [[-1, 9], 1, Concat, [1]]                     # 20
  - [-1, 3, C2f, [1024]]                          # 21 - P5 out

  - [[15, 18, 21], 1, Detect, [nc]]               # 22 - detect
